Revit 2027 API
ScheduleDefinition.InsertSortGroupField Method
 Adds a new sorting/grouping field at the specified position in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertSortGroupField(
	ScheduleSortGroupField sortGroupField,
	int index
)
Public Sub InsertSortGroupField (
	sortGroupField As ScheduleSortGroupField,
	index As Integer
)
public:
void InsertSortGroupField(
	ScheduleSortGroupField^ sortGroupField,
	int index
)
member InsertSortGroupField :
        sortGroupField : ScheduleSortGroupField *
        index : int -> unit
Parameters
sortGroupField ScheduleSortGroupField
 The sorting/grouping field to add.
index Int32
 The index in the list of sorting/grouping fields.
Exceptions
Exception | Condition
ArgumentException |  The field ID is not the ID of a field in this ScheduleDefinition. -or- The field cannot be used for sorting/grouping.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  index is not a valid insert position.
InvalidOperationException |  The resulting sorting/grouping field count would be greater than 4.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace